app/controllers/api/users_controller.rb

  def index
      @users = User.paginate(page: params[:page],
                             per_page: params[:per_page])
                   .order('surname, firstname')
---
SELECT  "users".* FROM "users" ORDER BY surname, firstname LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]