app/views/users/index.html.erb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
<div class='sub-input-area'>
  <%= form_tag search_users_path, title: I18n.t('users.search-accounts'), method: :get do %>