app/controllers/broadcasts_controller.rb

  def index
    @broadcasts = Broadcast.paginate(page: params[:page],
                                     per_page: params[:per_page])
                           .order('created_at DESC')
---
SELECT  "broadcasts".* FROM "broadcasts" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "broadcasts"

  def create
    @broadcast = Broadcast.new(broadcast_params)

    # Wire up broadcast with the current user (an administrator)
    # Will be an admin user (see before_action)
    # Note the current_user is a user_detail object so we need
    # to navigate to its user object
    @broadcast.user = current_user.user

    # Doing the next line forces a save automatically. I want to defer this
    # until the "if" statement
    #current_user.user.broadcasts << @broadcast

    no_errors = false
    respond_to do |format|
      if @broadcast.save
---
INSERT INTO "broadcasts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "one two three"], ["user_id", 41], ["created_at", 2016-08-12 07:52:46 UTC], ["updated_at", 2016-08-12 07:52:46 UTC]]

  def set_broadcast
    @broadcast = Broadcast.find(params[:id])
---
SELECT  "broadcasts".* FROM "broadcasts" WHERE "broadcasts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]