app/controllers/users_controller.rb

  def search
    # Use will_paginate's :conditions and :joins to search across both the
    # users and user_details tables. search_fields private method will add a field
    # for each checkbox field checked by the user, or returns nil
    # if none were checked. The search_conditions method is defined
    # in lib/searchable.rb and either searches across all columns identified in
    # User.searchable_by or uses the search_fields to constrain the search

    respond_to do |format|
      format.html {
        @users = User.where(User.search_conditions(params[:q], search_fields(User)))
                     .joins(:user_detail)
                     .paginate(page: params[:page],
                               per_page: params[:per_page])
                     .order('surname, firstname')
---
SELECT  "users".* FROM "users" INNER JOIN "user_details" ON "user_details"."user_id" = "users"."id" WHERE ((LOWER(firstname) LIKE '%lo%' OR LOWER(surname) LIKE '%lo%' OR LOWER(grad_year) LIKE '%lo%' OR LOWER(phone) LIKE '%lo%' OR LOWER(email) LIKE '%lo%')) ORDER BY surname, firstname LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" INNER JOIN "user_details" ON "user_details"."user_id" = "users"."id" WHERE ((LOWER(firstname) LIKE '%cwl1%' OR LOWER(surname) LIKE '%cwl1%' OR LOWER(grad_year) LIKE '%cwl1%' OR LOWER(phone) LIKE '%cwl1%' OR LOWER(email) LIKE '%cwl1%'))

  def index
      @users = User.paginate(page: params[:page],
                             per_page: params[:per_page])
                   .order('surname, firstname')
---
SELECT  "users".* FROM "users" ORDER BY surname, firstname LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(user_params)

    # Only create a new image if the :image_file parameter
    # was specified
    @image = Image.new(photo: params[:image_file]) if params[:image_file]

    # The ImageService model wraps up application logic to
    # handle saving images correctly
    @service = ImageService.new(@user, @image)

    respond_to do |format|
      if @service.save # Will attempt to save user and image
---
INSERT INTO "images" ("user_id", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 45], ["photo_file_name", "cwl.jpg"], ["photo_content_type", "image/jpeg"], ["photo_file_size", 55392], ["photo_updated_at", 2016-08-10 12:00:25 UTC]]
INSERT INTO "users" ("surname", "firstname", "phone", "grad_year", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["surname", "Loftus"], ["firstname", "Chris"], ["phone", ""], ["grad_year", 1985], ["email", "cwl@aber.ac.uk"], ["created_at", 2016-08-01 14:14:23 UTC], ["updated_at", 2016-08-01 14:14:23 UTC]]